atanisoft/ESP32CommandStation/main/WebServer.cpp
private:
  openlcb::NodeHandle nodeHandle_;
  openlcb::MemoryConfigClient *client_;

  StateFlowBase::Action entry() override
  {
    request()->resultCode = openlcb::DatagramClient::OPERATION_PENDING;
    switch (request()->cmd)
    {
      case CDIClientRequest::CMD_READ:
        LOG(VERBOSE, "[CDI:%s] Requesting %zu bytes from offset %zu"
          , request()->target.c_str(), request()->size, request()->offs);
        return invoke_subflow_and_wait(client_, STATE(read_complete)
                                     , openlcb::MemoryConfigClientRequest::READ_PART
                                     , nodeHandle_
                                     , openlcb::MemoryConfigDefs::SPACE_CONFIG
                                     , request()->offs, request()->size);
      case CDIClientRequest::CMD_WRITE:
        LOG(VERBOSE, "[CDI:%s] Writing %zu bytes from offset %zu"
          , request()->target.c_str(), request()->size, request()->offs);
        return invoke_subflow_and_wait(client_, STATE(write_complete)
                                     , openlcb::MemoryConfigClientRequest::WRITE
                                     , nodeHandle_
                                     , openlcb::MemoryConfigDefs::SPACE_CONFIG
                                     , request()->offs, request()->value);
      case CDIClientRequest::CMD_UPDATE_COMPLETE:
        invoke_subflow_and_ignore_result(client_
                                       , openlcb::MemoryConfigClientRequest::UPDATE_COMPLETE
                                       , nodeHandle_);
        return return_ok();
    }
    return return_with_error(openlcb::Defs::ERROR_UNIMPLEMENTED_SUBCMD);
  }

  StateFlowBase::Action read_complete()
  {
    auto b = get_buffer_deleter(full_allocation_result(client_));
    if (b->data()->resultCode)
    {
      string response =
          StringPrintf(
              R"!^!({"res":"error","error":"request failed: %d","id":%d}\m)!^!"
            , b->data()->resultCode, request()->req_id);
      request()->socket->send_text(response);
      return return_with_error(b->data()->resultCode);
    }
    string response;
    LOG(VERBOSE, "[CDI:%s] Received %zu bytes from offset %zu"
      , request()->target.c_str(), request()->size, request()->offs);
    if (request()->type == "str")
    {
      response =
        StringPrintf(
            R"!^!({"res":"field","tgt":"%s","value":"%s","type":"str","id":%d})!^!"
          , request()->target.c_str(), b->data()->payload.c_str(), request()->req_id);
    }
    else if (request()->type == "int")
    {
      uint32_t data = b->data()->payload.data()[0];
      if (request()->size == 2)
      {
        uint16_t data16 = 0;
        memcpy(&data16, b->data()->payload.data(), sizeof(uint16_t));
        data = be16toh(data16);
      }
      else if (request()->size == 4)
      {
        uint32_t data32 = 0;
        memcpy(&data32, b->data()->payload.data(), sizeof(uint32_t));
        data = be32toh(data32);
      }
      response =
        StringPrintf(
            R"!^!({"res":"field","tgt":"%s","value":"%d","type":"int","id":%d})!^!"
        , request()->target.c_str(), data, request()->req_id);
    }
    else if (request()->type == "evt")
    {
      uint64_t event_id = 0;
      memcpy(&event_id, b->data()->payload.data(), sizeof(uint64_t));
      response =
        StringPrintf(
            R"!^!({"res":"field","tgt":"%s","value":"%s","type":"evt","id":%d})!^!"
        , request()->target.c_str()
        , uint64_to_string_hex(be64toh(event_id)).c_str(), request()->req_id);
    }
    LOG(VERBOSE, "[CDI-READ] %s", response.c_str());
    request()->socket->send_text(response);
    return return_ok();
  }

  StateFlowBase::Action write_complete()
  {
    auto b = get_buffer_deleter(full_allocation_result(client_));
    if (b->data()->resultCode)
    {
      string response =
          StringPrintf(
              R"!^!({"res":"error","error":"request failed: %d","id":%d})!^!"
            , b->data()->resultCode, request()->req_id);
      request()->socket->send_text(response);
      return return_with_error(b->data()->resultCode);
    }
      
    string response =
          StringPrintf(R"!^!({"res":"saved","tgt":"%s","id":%d})!^!"
                      , request()->target.c_str(), request()->req_id);
    LOG(VERBOSE, "[CDI-WRITE] %s", response.c_str());
    request()->socket->send_text(response);
    return return_ok();
  }
};

#define GET_LOCO_VIA_EXECUTOR(NAME, address)                                        \
  openlcb::TrainImpl *NAME = nullptr;                                               \
  Singleton<esp32cs::LCCStackManager>::instance()->stack()->executor()->sync_run(   \
  ([&]()                                                                            \
  {                                                                                 \
    NAME = Singleton<commandstation::AllTrainNodes>::instance()->get_train_impl(    \
                                      commandstation::DccMode::DCC_128, address);   \
  }));

#define REMOVE_LOCO_VIA_EXECUTOR(addr)                                              \
  Singleton<esp32cs::LCCStackManager>::instance()->stack()->executor()->sync_run(   \
  ([&]()                                                                            \
  {                                                                                 \
    Singleton<commandstation::AllTrainNodes>::instance()->remove_train_impl(addr);  \
  }));

std::unique_ptr<CDIClient> cdi_client;

void init_webserver()
{
  auto httpd = Singleton<Httpd>::instance();
  cdi_client.reset(new CDIClient());
  httpd->captive_portal(
    StringPrintf(CAPTIVE_PORTAL_HTML
               , esp_ota_get_app_description()->version));
  httpd->static_uri("/", indexHtmlGz, indexHtmlGz_size
                  , MIME_TYPE_TEXT_HTML, HTTP_ENCODING_GZIP, false);
  httpd->static_uri("/loco-32x32.png", loco32x32, loco32x32_size
                  , MIME_TYPE_IMAGE_PNG);
  httpd->static_uri("/cash.min.js", cashJsGz, cashJsGz_size
                  , MIME_TYPE_TEXT_JAVASCRIPT, HTTP_ENCODING_GZIP);
  httpd->static_uri("/spectre.min.css", spectreCssGz, spectreCssGz_size
                  , MIME_TYPE_TEXT_CSS, HTTP_ENCODING_GZIP);
  httpd->static_uri("/cdi.xml", (const uint8_t *)openlcb::CDI_DATA
                  , openlcb::CDI_SIZE - 1, MIME_TYPE_TEXT_XML);
  httpd->websocket_uri("/ws", process_ws);
  httpd->websocket_uri("/wsjson", process_wsjson);
  httpd->uri("/update", HttpMethod::POST, nullptr, process_ota);
  httpd->uri("/version", [&](HttpRequest *req)
  {
    const esp_app_desc_t *app_data = esp_ota_get_app_description();
    const esp_partition_t *partition = esp_ota_get_running_partition();
    string version =
      StringPrintf("{\"version\":\"%s\",\"build\":\"%s\","
                    "\"timestamp\":\"%s %s\",\"ota\":\"%s\",\"uptime\":%llu}"
                 , CONFIG_ESP32CS_SW_VERSION, app_data->version
                 , app_data->date, app_data->time
                 , partition->label, esp_timer_get_time());
    return new JsonResponse(version);
  });
  httpd->uri("/fs", HttpMethod::GET,
  [&](HttpRequest *request) -> AbstractHttpResponse *
  {
    string path = request->param("path");
    struct stat statbuf;
    // verify that the requested path exists
    if (!stat(path.c_str(), &statbuf))
    {
      string data = read_file_to_string(path);
      string mimetype = http::MIME_TYPE_TEXT_PLAIN;
      if (path.find(".xml") != string::npos)
      {
        mimetype = MIME_TYPE_TEXT_XML;
      }
      else if (path.find(".json") != string::npos)
      {
        mimetype = http::MIME_TYPE_APPLICATION_JSON;
      }
      return new StringResponse(data, mimetype);
    }
    request->set_status(HttpStatusCode::STATUS_NOT_FOUND);
    return nullptr;
  });
  httpd->uri("/power", HttpMethod::GET | HttpMethod::PUT, process_power);
  httpd->uri("/programmer", HttpMethod::GET | HttpMethod::POST, process_prog);
  httpd->uri("/turnouts"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_turnouts);
  httpd->uri("/locomotive"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_loco);
  httpd->uri("/locomotive/roster"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_loco);
  httpd->uri("/locomotive/estop"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_loco);
#if CONFIG_GPIO_OUTPUTS
  httpd->uri("/outputs"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_outputs);
#endif // CONFIG_GPIO_OUTPUTS
#if CONFIG_GPIO_SENSORS
  httpd->uri("/sensors"
          , HttpMethod::GET | HttpMethod::POST | HttpMethod::DELETE
          , process_sensors);
  httpd->uri("/remoteSensors"
          , HttpMethod::GET | HttpMethod::POST | HttpMethod::DELETE
          , process_remote_sensors);
#if CONFIG_GPIO_S88
  httpd->uri("/s88sensors"
          , HttpMethod::GET | HttpMethod::POST | HttpMethod::DELETE
          , process_s88);
#endif // CONFIG_GPIO_S88
#endif // CONFIG_GPIO_SENSORS
}

WEBSOCKET_STREAM_HANDLER_IMPL(process_ws, client, event, data
                            , data_len)
{
  LOG(VERBOSE, "[WS %p/%d] handler invoked: %d, %p, %zu", client, client->id(), event, data, data_len);
  if (event == WebSocketEvent::WS_EVENT_CONNECT)
  {
    const std::lock_guard<std::mutex> lock(webSocketLock);
    webSocketClients.push_back(
      std::make_unique<WebSocketClient>(client->id(), client->ip()));
  }
  else if (event == WebSocketEvent::WS_EVENT_DISCONNECT)
  {
    const std::lock_guard<std::mutex> lock(webSocketLock);
    webSocketClients.erase(std::remove_if(webSocketClients.begin()
                                        , webSocketClients.end()
    , [client](const auto &inst) -> bool
      {
        return inst->id() == client->id();
      }));
  }
  else if (event == WebSocketEvent::WS_EVENT_TEXT)
  {
    auto ent = std::find_if(webSocketClients.begin(), webSocketClients.end()
    , [client](const auto &inst) -> bool
      {
        return inst->id() == client->id();
      }
    );
    if (ent != webSocketClients.end())
    {
      LOG(VERBOSE, "[WS %p/%d] feeding the DCC++ code", client, client->id());
      // TODO: remove cast that drops const
      auto res = (*ent)->feed((uint8_t *)data, data_len);
      if (res.length())
      {
        LOG(VERBOSE, "[WS %p/%d] sending %zu bytes as response", client, client->id(), res.length());
        client->send_text(res);
        LOG(VERBOSE, "[WS %p/%d] sent", client, client->id());
      }
      else
      {
        LOG(VERBOSE, "[WS %p/%d] no response to send", client, client->id());
      }
    }
  }
}

#ifdef CONFIG_GPIO_S88
#define GPIO_S88_CONFIG "true"
#define GPIO_S88_BASE CONFIG_GPIO_S88_FIRST_SENSOR
#else
#define GPIO_S88_CFG "false"
#define GPIO_S88_BASE 0
#endif

